'''
GIT - это распределенная система контроля версий
Это система для отслеживания и введения истории изменения файлов, в вашем проекте. При помощи распределенности git еще и организовывается 
командная работа.


Репозиторий - это хранилище вашего кода и истории его изменений


GitHUB - веб сайт для размещения GIT-репозиториев в совместной разработке проектов

Команды Git :

1. git init - она создает новый локальный репозиторий, в той директории в которой была прописана команда.
(Команда вводится один раз в начале)

2. git add - команда для добавления изменений в систему отслеживания гита

3. git commit -m '<comment>' - это команда для сохранения всех изменений в локальном репозитории с 
комментарием к ним

4. git remote add <origin> <url> -  это команда для того чтобы связать ваш локальный репо с удаленным репо 
в гитхабе

5. git push <origin> <main> - команда отправки всех ваших изменений на удаленный репо 
'''

'''
1. git init
    2. git add .
    3. git commit -m ''
4. git remote add origin <url>
    5. git push origin main
'''

# git init
# git add README.md
# git commit -m "first commit"
# git branch -M main
# git remote add origin git@github.com:AzimCapsID/es.git
# git push -u origin main
















